Scarcha/PSD-construction-in-STM32F407G-DISC1/FFTplusMIC/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "crc.h"
#include "dma.h"
#include "i2c.h"
#include "i2s.h"
#include "pdm2pcm.h"
#include "spi.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "arm_math.h"
#include <stdint.h>
#include <string.h>
#include <math.h>
#include <stdio.h>
#include "../Components/cs43l22/cs43l22.h"
#include "../STM32F4-Discovery/stm32f4_discovery.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
enum ERROR{
	CHILL = -20,
	PDM2PCM = -21,
	CODEC = -22,
	I2S_TX = -23,
	I2S_RX = -24,
	CODEC_PLAY = -25,
	OVR = -26,
	UDR = -27,
};

enum SWITCH{
	IDLE = 0,
	FIRST_HALF = 1,
	SECOND_HALF = 2,
};
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PCM_SAMPLING_FREQ       32000U  // Frecuencia de muestreo PCM (Hz)
#define AUDIO_FREQ_PDM_HAL      64000U  // Para I2S2_BCLK ~2.048MHz -> 32kHz PCM con OSR 64
#define CS43L22_ADDRESS         0x94U   // Dirección I2C del CS43L22

// --- Configuración FFT ---
#define FFT_SIZE                1024U

// --- Canales (Según tu IOC para PDM2PCM y necesidad del CODEC) ---
#define PDM_FILTER_OUT_CHANNELS 1U      // El filtro PDM produce MONO
#define CODEC_PCM_OUT_CHANNELS  2U      // La salida al CODEC es ESTÉREO

// --- Parámetros del Filtro PDM (Basados en config. IOC y librería) ---
#define PDM_SAMPLES_PER_PDM_LIB_CALL  16  // Asumiendo PDM1_filter_config.output_samples_number = 16 (mono)
#define PDM_DECIMATION_FACTOR         64  // Asumiendo PDM1_filter_config.decimation_factor = PDM_FILTER_DEC_FACTOR_64

// --- Cálculo de Tamaños de Buffer Basados en FFT_SIZE y Config PDM ---
#define PCM_MONO_SAMPLES_PER_FFT_FRAME   FFT_SIZE // 1024 muestras MONO

#define PDM_BYTES_PER_PROCESS_CALL    (PDM_SAMPLES_PER_PDM_LIB_CALL * (PDM_DECIMATION_FACTOR / 8U)) // 16 * 8 = 128 bytes
#define NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME (PCM_MONO_SAMPLES_PER_FFT_FRAME / PDM_SAMPLES_PER_PDM_LIB_CALL) // 1024 / 16 = 64 llamadas

#define PDM_RAW_INPUT_FFT_FRAME_SIZE_BYTES   (PDM_BYTES_PER_PROCESS_CALL * NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME) // 128 * 64 = 8192 bytes
#define PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16  (PDM_RAW_INPUT_FFT_FRAME_SIZE_BYTES / 2U) // 4096

// Para el buffer de salida estéreo al CODEC (si el loopback sigue activo)
#define PCM_STEREO_OUTPUT_HALF_BUFFER_SIZE_UINT16  (PCM_MONO_SAMPLES_PER_FFT_FRAME * CODEC_PCM_OUT_CHANNELS) // 1024 * 2 = 2048

// --- UART ---
#define UART_BUFFER_SIZE 256 // Para formatear strings antes de enviar

// --- Para la conversión a dB ---
#define DB_FLOOR -80.0f
#define EPSILON  1e-9f
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
extern PDM_Filter_Handler_t PDM1_filter_handler;
extern PDM_Filter_Config_t PDM1_filter_config;

// Buffers Ping-Pong para la entrada PDM
uint16_t pdm_raw_buffer[2][PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16];
// Buffer para la salida PCM MONO del filtro PDM
int16_t  pcm_mono_fft_input_buffer[PCM_MONO_SAMPLES_PER_FFT_FRAME];

volatile uint8_t pdm_input_buffer_idx = 2; // 0: primera mitad PDM lista, 1: segunda, 2: ninguna

// Buffers y Handles para FFT
float32_t fft_input_f32[FFT_SIZE];
float32_t fft_output_f32[FFT_SIZE];
arm_rfft_fast_instance_f32 fft_instance;

// Buffer para transmisión UART
char uart_tx_buffer[UART_BUFFER_SIZE];

// Ventana Hann
float32_t hann_window[FFT_SIZE];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void init_hann_window(void) {
    for (int i = 0; i < FFT_SIZE; i++) {
        hann_window[i] = 0.5f * (1.0f - arm_cos_f32(2.0f * PI * i / (FFT_SIZE - 1.0f)));
    }
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
	  uint16_t pdm_buffer_offset_uint16 = 0;
	  uint16_t pcm_mono_buffer_offset = 0;

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2S2_Init();
  MX_CRC_Init();
  MX_PDM2PCM_Init();
  MX_USART2_UART_Init();
  MX_SPI1_Init();
  MX_I2C1_Init();
  /* USER CODE BEGIN 2 */
  	  init_hann_window();

    // Inicializar FFT
    if (arm_rfft_fast_init_f32(&fft_instance, FFT_SIZE) != ARM_MATH_SUCCESS) {
        Error_Handler();
    }

    // Iniciar DMA I2S2 para PDM
    if (HAL_I2S_Receive_DMA(&hi2s2, (uint16_t *)pdm_raw_buffer, PDM_RAW_INPUT_FFT_FRAME_SIZE_UINT16 * 2) != HAL_OK) {
      Error_Handler();
    }
    pdm_input_buffer_idx = 2; // Ningún buffer PDM listo


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  if (pdm_input_buffer_idx != 2) { // Un buffer PDM (un frame FFT) está listo
	        uint16_t* current_pdm_input_half_ptr;

	        if (pdm_input_buffer_idx == 0) {
	          current_pdm_input_half_ptr = pdm_raw_buffer[0];
	        } else { // pdm_input_buffer_idx == 1
	          current_pdm_input_half_ptr = pdm_raw_buffer[1];
	        }

	        //  Convertir el frame PDM completo a PCM MONO en pcm_mono_fft_input_buffer
	        pdm_buffer_offset_uint16 = 0;
	        pcm_mono_buffer_offset = 0;
	        for (int i = 0; i < NUM_PDM_PROCESS_CALLS_PER_FFT_FRAME; i++) {
	          if (MX_PDM2PCM_Process(
	                  current_pdm_input_half_ptr + pdm_buffer_offset_uint16,
	                  (uint16_t*)(pcm_mono_fft_input_buffer + pcm_mono_buffer_offset)
	               ) != 0) {
	          }
	          pdm_buffer_offset_uint16 += (PDM_BYTES_PER_PROCESS_CALL / 2U);
	          pcm_mono_buffer_offset += PDM_SAMPLES_PER_PDM_LIB_CALL;
	        }

	        // Preparar datos para FFT: Convertir int16_t PCM a float32_t y aplicar ventana
	        for (int i = 0; i < FFT_SIZE; i++) {
	            fft_input_f32[i] = (float32_t)pcm_mono_fft_input_buffer[i] * hann_window[i]; // Aplicar ventana
	        }

	        // Calcular RFFT
	        arm_rfft_fast_f32(&fft_instance, fft_input_f32, fft_output_f32, 0);

	        // Enviar Magnitudes FFT en dB por UART
	        int uart_len = 0;
	        float32_t mag_val, db_val;

	        // Enviar SOF
	        uart_len = sprintf(uart_tx_buffer, "SOF\r\n");
	        HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
	        uart_len = 0;

	        // Bin 0 (DC)
	        mag_val = fabsf(fft_output_f32[0]);
	        if (mag_val < EPSILON) { db_val = DB_FLOOR; }
	        else { db_val = 20.0f * log10f(mag_val); if (db_val < DB_FLOOR) { db_val = DB_FLOOR; } }
	        uart_len += sprintf(uart_tx_buffer + uart_len, "%.2f\r\n", db_val);

	        // Bins 1 a (FFT_SIZE / 2) - 1
	        for (int k = 1; k < FFT_SIZE / 2; k++) {
	            float32_t real_part = fft_output_f32[2*k];
	            float32_t imag_part = fft_output_f32[2*k+1];
	            arm_sqrt_f32(real_part * real_part + imag_part * imag_part, &mag_val);


	            if (mag_val < EPSILON) { db_val = DB_FLOOR; }
	            else { db_val = 20.0f * log10f(mag_val); if (db_val < DB_FLOOR) { db_val = DB_FLOOR; } }
	            uart_len += sprintf(uart_tx_buffer + uart_len, "%.2f\r\n", db_val);

	            if (uart_len > (UART_BUFFER_SIZE - 20) || k == (FFT_SIZE / 2) - 1) {
	                if (uart_len > 0) {
	                    HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
	                    uart_len = 0;
	                }
	            }
	        }
	        if (uart_len > 0) {
	            HAL_UART_Transmit(&huart2, (uint8_t*)uart_tx_buffer, uart_len, HAL_MAX_DELAY);
	        }

	        pdm_input_buffer_idx = 2;
	        HAL_Delay(100);
	  } else{
		  HAL_Delay(1);
	  }

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 8;
  RCC_OscInitStruct.PLL.PLLN = 336;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/* USER CODE BEGIN 4 */
void HAL_I2S_RxHalfCpltCallback(I2S_HandleTypeDef *hi2s)
{
  if (hi2s->Instance == SPI2) {
    pdm_input_buffer_idx = 0;
  }
}

void HAL_I2S_RxCpltCallback(I2S_HandleTypeDef *hi2s)
{
  if (hi2s->Instance == SPI2) {
    pdm_input_buffer_idx = 1;
  }
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
